Examinator/src/Catalogs/ШаблоныСообщенийСУО/ШаблоныСообщенийСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ШаблоныСообщенийСУО</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Заголовок</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФорматированныйДокумент</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Действующий</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипШаблона</name>
    <type>
      <types>EnumRef.ТипыШаблоновСообщенийСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипАвтоматическойРассылки</name>
    <type>
      <types>EnumRef.ТипыАвтоматическихРассылокСУО</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Переменные</name>
    <attributes>
      <name>Переменная</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ПеременныеШаблоновСообщенийСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Организаторы</name>
    <comment>Заполняется в подписке УстановитьОтветственногоЭлементаСправочникаСУО</comment>
    <attributes>
      <name>Организатор</name>
      <type>
        <types>CatalogRef.ОрганизаторыСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеПеременные</name>
    <attributes>
      <name>Переменная</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяПеременной</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Examinator/src/Enums/ТипыШаблоновСообщенийСУО/ТипыШаблоновСообщенийСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыШаблоновСообщенийСУО</name>
  <enumValues>
    <name>АвтоматическаяРассылка</name>
  </enumValues>
  <enumValues>
    <name>РучнаяРассылка</name>
  </enumValues>
  <enumValues>
    <name>СбросПароля</name>
  </enumValues>
  <enumValues>
    <name>ОбъединениеДубликатовПользователей</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Enums/ТипыАвтоматическихРассылокСУО/ТипыАвтоматическихРассылокСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыАвтоматическихРассылокСУО</name>
  <enumValues>
    <name>ПриЗачисленииНаМероприятие</name>
  </enumValues>
  <enumValues>
    <name>ПриЗачисленииНаПрограммуОбучения</name>
  </enumValues>
  <enumValues>
    <name>ПриНачалеПрохожденияМероприятия</name>
  </enumValues>
  <enumValues>
    <name>ПриНачалеПрохожденияПрограммыОбучения</name>
  </enumValues>
  <enumValues>
    <name>ПослеПрохожденияМероприятия</name>
  </enumValues>
  <enumValues>
    <name>ПослеПрохожденияПрограммыОбучения</name>
  </enumValues>
  <enumValues>
    <name>ПриглашениеНаОткрытоеМероприятие</name>
  </enumValues>
  <enumValues>
    <name>ПриглашениеНаОткрытуюПрограммуОбучения</name>
  </enumValues>
  <enumValues>
    <name>ПриНазначенииПреподавателяНаМероприятие</name>
  </enumValues>
  <enumValues>
    <name>КонтрольНепрочитанныхЛичныхСообщений</name>
  </enumValues>
  <enumValues>
    <name>КонтрольНепрочитанныхТемФорума</name>
  </enumValues>
  <enumValues>
    <name>ПриОтправкеЗаданияНаПроверку</name>
  </enumValues>
  <enumValues>
    <name>ВажнаяНовость</name>
  </enumValues>
  <enumValues>
    <name>ВосстановлениеПароля</name>
  </enumValues>
  <enumValues>
    <name>РегистрацияНовогоПользователя</name>
  </enumValues>
  <enumValues>
    <name>ПередОкончаниемДоступаКБазе</name>
  </enumValues>
  <enumValues>
    <name>ПриОбновленииОтбораПользователей</name>
  </enumValues>
  <enumValues>
    <name>ПослеПроверкиЗаданияПреподавателем</name>
  </enumValues>
  <enumValues>
    <name>ПослеВозвратаНаДоработкуЗадания</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Catalogs/ВидыКонтактнойИнформации/ВидыКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыКонтактнойИнформации</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>СправочникОрганизации</name>
      <description>Контактная информация справочника &quot;Организации&quot;</description>
    </items>
    <items>
      <name>СправочникПользователи</name>
      <description>Контактная информация справочника &quot;Пользователи&quot;</description>
    </items>
    <items>
      <name>СправочникТерриторииСУО</name>
      <description>Контактная информация справочника &quot;Территории&quot;</description>
    </items>
  </predefined>
  <attributes>
    <name>ТолькоНациональныйАдрес</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПоляДругое</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВключатьСтрануВПредставление</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретитьРедактированиеПользователем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МожноИзменятьСпособРедактирования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбязательноеЗаполнение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьКорректность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьПоФИАС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьВводНесколькихЗначений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РедактированиеТолькоВДиалоге</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СкрыватьНеактуальныеАдреса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонCДобавочнымНомером</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыКонтактнойИнформации</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьМногострочноеПоле</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УказыватьОКТМО</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранитьИсториюИзменений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МеждународныйФорматАдреса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПредопределенногоВида</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяГруппы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Представления</name>
    <attributes>
      <name>КодЯзыка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Examinator/src/ChartsOfCharacteristicTypes/ДополнительныеРеквизитыИСведения/ДополнительныеРеквизитыИСведения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>ДополнительныеРеквизитыИСведения</name>
  <type>
    <types>Boolean</types>
    <types>CatalogRef.ЗначенияСвойствОбъектов</types>
    <types>String</types>
    <types>Date</types>
    <types>Number</types>
    <numberQualifiers>
      <precision>15</precision>
      <scale>3</scale>
    </numberQualifiers>
    <stringQualifiers>
      <length>150</length>
    </stringQualifiers>
  </type>
  <attributes>
    <name>Виден</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВладелецДополнительныхЗначений</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьВВидеГиперссылки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныеЗначенияИспользуются</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныеЗначенияСВесом</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Доступен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Заголовок</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>75</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаголовокФормыВыбораЗначения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаголовокФормыЗначения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаполнятьОбязательно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>МногострочноеПолеВвода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаборСвойств</name>
    <type>
      <types>CatalogRef.НаборыДополнительныхРеквизитовИСведений</types>
    </type>
  </attributes>
  <attributes>
    <name>Подсказка</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСклоненияПредмета</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматСвойства</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоДополнительноеСведение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗависимостиДополнительныхРеквизитов</name>
    <attributes>
      <name>ЗависимоеСвойство</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Реквизит</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
        <types>String</types>
        <stringQualifiers>
          <length>99</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Условие</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Представления</name>
    <attributes>
      <name>КодЯзыка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Заголовок</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>75</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Подсказка</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаголовокФормыЗначения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗаголовокФормыВыбораЗначения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:ChartOfCharacteristicTypes>

Examinator/src/Catalogs/ШаблоныСообщенийСУО/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая()
		И Параметры.Свойство("ЗначениеКопирования") 
		И ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		
		ШаблонСообщения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.ЗначениеКопирования, "ФорматированныйДокумент").Получить();
	
	КонецЕсли;
	
	УстановитьДоступностьЭлементовФормы();	
	ЗаполнитьТаблицуПеременных();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ШаблонСообщения = ТекущийОбъект.ФорматированныйДокумент.Получить();

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если НЕ ЗаполнитьПеременныеВручную Тогда
		ТекущийОбъект.Переменные.Очистить();
		ТекущийОбъект.ДополнительныеПеременные.Очистить();
		Для каждого СтрокаТП Из Переменные Цикл	
			Если ТипЗнч(СтрокаТП.Переменная) = Тип("ПланВидовХарактеристикСсылка.ПеременныеШаблоновСообщенийСУО") Тогда
				НоваяСтрокаТЧ = ТекущийОбъект.Переменные.Добавить();
				НоваяСтрокаТЧ.Переменная = СтрокаТП.Переменная;
			КонецЕсли;	
			Если ТипЗнч(СтрокаТП.Переменная) = Тип("СправочникСсылка.ВидыКонтактнойИнформации")
				ИЛИ ТипЗнч(СтрокаТП.Переменная) = Тип("ПланВидовХарактеристикСсылка.ДополнительныеРеквизитыИСведения") Тогда
				НоваяСтрокаТЧ = ТекущийОбъект.ДополнительныеПеременные.Добавить();
				НоваяСтрокаТЧ.Переменная = СтрокаТП.Переменная;
				НоваяСтрокаТЧ.ИмяПеременной = СтрокаТП.Код;
			КонецЕсли;		
		КонецЦикла;
	КонецЕсли;
	ТекущийОбъект.ФорматированныйДокумент = Новый ХранилищеЗначения(ШаблонСообщения, Новый СжатиеДанных(9));
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ТипШаблонаПриИзменении(Элемент)
	УстановитьДоступностьЭлементовФормы();
	ЗаполнитьТаблицуПеременных();
КонецПроцедуры

&НаКлиенте
Процедура ТипАвтоматическойРассылкиПриИзменении(Элемент)
	ЗаполнитьТаблицуПеременных();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ВставитьПеременнуюВТекст(Команда)
	ВставитьПеременнуюВШаблон();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПеременные

// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ  Переменные

&НаКлиенте
Процедура ПеременныеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ВставитьПеременнуюВШаблон();
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура ЗаполнитьТаблицуПеременных()
	
	Переменные.Очистить();
	
	// Переменные, которые есть всегда
	
	НоваяПеременная = Переменные.Добавить();
	НоваяПеременная.Переменная = "Полное имя адресата";
	НоваяПеременная.Код = "ПолноеИмяАдресата";
	НоваяПеременная.Подсказка = НСтр("ru = 'Полное имя пользователя, которому отправляется сообщение'");
	
	НоваяПеременная = Переменные.Добавить();
	НоваяПеременная.Переменная = "Логин адресата";
	НоваяПеременная.Код = "ЛогинАдресата";
	НоваяПеременная.Подсказка = НСтр("ru = 'Логин пользователя, которому отправляется сообщение'");
	
	НоваяПеременная = Переменные.Добавить();
	НоваяПеременная.Переменная = "Отправитель";
	НоваяПеременная.Код = "Отправитель";
	НоваяПеременная.Подсказка = НСтр("ru = 'Для личных сообщений Отправитель указан в настройках программы, поле «Автор автоматических рассылок для личных сообщений». Для сообщений на электронную почту Отправитель указан в настройках системной учетной записи электронной почты'");
	
	// Переменные автоматических рассылок
	
	Если Объект.ТипШаблона = Перечисления.ТипыШаблоновСообщенийСУО.АвтоматическаяРассылка Тогда
		
		ТаблицаПеременныхАР = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ТаблицаПеременныхАвтоматическойРассылки(Объект.ТипАвтоматическойРассылки);
		
		Для каждого СтрокаТП Из ТаблицаПеременныхАР Цикл
			НоваяПеременная = Переменные.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяПеременная, СтрокаТП); 
			НоваяПеременная.Код = НоваяПеременная.Код;
		КонецЦикла;		
		
				
	КонецЕсли;
	
	// Переменные сброса пароля
	
	Если Объект.ТипШаблона = Перечисления.ТипыШаблоновСообщенийСУО.СбросПароля Тогда
		
		НоваяПеременная = Переменные.Добавить();
		НоваяПеременная.Переменная = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.НовыйПароль;
		НоваяПеременная.Код = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.КодПеременной(НоваяПеременная.Переменная);
		НоваяПеременная.Подсказка = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ПодсказкаКПеременной(НоваяПеременная.Переменная);	
		
	КонецЕсли;
	
	// Объединение дубликатов пользователей
	
	Если Объект.ТипШаблона = Перечисления.ТипыШаблоновСообщенийСУО.ОбъединениеДубликатовПользователей Тогда
		
		НоваяПеременная = Переменные.Добавить();
		НоваяПеременная.Переменная = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ОбъединенныеЛогины;
		НоваяПеременная.Код = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.КодПеременной(НоваяПеременная.Переменная);
		НоваяПеременная.Подсказка = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ПодсказкаКПеременной(НоваяПеременная.Переменная);	
		
	КонецЕсли;	
	
	// Дополнительные переменные
	
	МожноВыводитьДопПеременные = Ложь;
	
	Если ЗначениеЗаполнено(Объект.ТипШаблона) Тогда
		Если Объект.ТипШаблона = Перечисления.ТипыШаблоновСообщенийСУО.АвтоматическаяРассылка Тогда
			Если ЗначениеЗаполнено(Объект.ТипАвтоматическойРассылки)
				И Объект.ТипАвтоматическойРассылки <> Перечисления.ТипыАвтоматическихРассылокСУО.ПриглашениеНаОткрытоеМероприятие
				И Объект.ТипАвтоматическойРассылки <> Перечисления.ТипыАвтоматическихРассылокСУО.ПриглашениеНаОткрытуюПрограммуОбучения
				И Объект.ТипАвтоматическойРассылки <> Перечисления.ТипыАвтоматическихРассылокСУО.ВажнаяНовость
				И Объект.ТипАвтоматическойРассылки <> Перечисления.ТипыАвтоматическихРассылокСУО.КонтрольНепрочитанныхЛичныхСообщений
				И Объект.ТипАвтоматическойРассылки <> Перечисления.ТипыАвтоматическихРассылокСУО.КонтрольНепрочитанныхТемФорума Тогда
				МожноВыводитьДопПеременные = Истина;
			КонецЕсли;
		Иначе
			МожноВыводитьДопПеременные = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если МожноВыводитьДопПеременные Тогда
		
		// Виды контактной информации
			
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ВидыКонтактнойИнформации.Наименование,
			|	ВидыКонтактнойИнформации.Ссылка,
			|	"""" КАК Подсказка
			|ИЗ
			|	Справочник.ВидыКонтактнойИнформации КАК ВидыКонтактнойИнформации
			|ГДЕ
			|	ВидыКонтактнойИнформации.Родитель = &РодительПользователи
			|	И ВидыКонтактнойИнформации.ПометкаУдаления = ЛОЖЬ";
		
		Запрос.УстановитьПараметр("РодительПользователи", Справочники.ВидыКонтактнойИнформации.СправочникПользователи);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			НоваяПеременная = Переменные.Добавить();
			НоваяПеременная.Переменная = ВыборкаДетальныеЗаписи.Ссылка;
			НоваяПеременная.Код = ВыборкаДетальныеЗаписи.Наименование;
			НоваяПеременная.Подсказка = ВыборкаДетальныеЗаписи.Подсказка;	
		КонецЦикла;

		// Дополнительные реквизиты
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ДополнительныеРеквизитыИСведения.Заголовок,
			|	ДополнительныеРеквизитыИСведения.Подсказка,
			|	ДополнительныеРеквизитыИСведения.Ссылка
			|ИЗ
			|	ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
			|ГДЕ
			|	ДополнительныеРеквизитыИСведения.ПометкаУдаления = ЛОЖЬ
			|	И ДополнительныеРеквизитыИСведения.НаборСвойств = &НаборСвойств";
		
		Запрос.УстановитьПараметр("НаборСвойств", УправлениеСвойствами.НаборСвойствПоИмени("Справочник_Пользователи"));
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			НоваяПеременная = Переменные.Добавить();
			НоваяПеременная.Переменная = ВыборкаДетальныеЗаписи.Ссылка;
			НоваяПеременная.Код = ВыборкаДетальныеЗаписи.Заголовок;
			НоваяПеременная.Подсказка = ВыборкаДетальныеЗаписи.Подсказка;	
		КонецЦикла;
		
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьЭлементовФормы()
	Элементы.ТипАвтоматическойРассылки.Видимость = ?(Объект.ТипШаблона = Перечисления.ТипыШаблоновСообщенийСУО.АвтоматическаяРассылка, Истина, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ВставитьПеременнуюВШаблон()
	
	ТекущиеДанные = Элементы.Переменные.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КодПеременной = "{{" + ТекущиеДанные.Код + "}}";
	НачалоВыделения = 0;
	КонецВыделения = 0;
	
	Элементы.ШаблонСообщения.ПолучитьГраницыВыделения(НачалоВыделения, КонецВыделения);
	ВставленныйТекст = ШаблонСообщения.Вставить(КонецВыделения, КодПеременной);
	ТекущийЭлемент = Элементы.ШаблонСообщения;
	Модифицированность = Истина;
	
КонецПроцедуры


#КонецОбласти
